IdeaRS.OpenModel.Geometry2D.SectionCharacteristics
Section characteristics

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.A
Gets or sets the area.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Sy
Gets or sets the first moment of area related to the Y axis.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Sz
Gets or sets the first moment of area related to the Z axis.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Iy
Gets or sets the second moment of area related to the Y axis.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Iz
Gets or sets the second moment of area related to the Z axis.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Dyz
Gets or sets the product moment of area.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Cgy
Gets the centre of gravity related to the axis Y.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Cgz
Gets the centre of gravity related to the axis Z.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Rgy
Gets the radius of gyration related to the axis Y.
Also known as iy.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Rgz
Gets the radius of gyration related to the axis Z.
Also known as iz.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.E
Gets or sets the responding E modulus.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Wely
Gets or sets the Elastic section modulus related to axis Y.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Welz
Gets or sets the Elastic section modulus related to axis Z.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Wply
Gets or sets the Plastic section modulus related to axis Y.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Wplz
Gets or sets the Plastic section modulus related to axis Z.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Iw
Gets or sets the Warping constant.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.It
Gets or sets the Torsional constant.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Y0
Gets or sets the Shear center coordinate Y related to the center of gravity.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Z0
Gets or sets the Shear center coordinate Z related to the center of gravity.

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Ay
Shear area

IdeaRS.OpenModel.Geometry2D.SectionCharacteristics.Az
Shear area